{
    "about": "Hi there! I’m a fourth-year Mathematics student at the University of Waterloo, with a double major in Computational Mathematics and Combinatorics & Optimization and a minor in Computer Science. I am proficient in multiple programming languages and web development technologies/frameworks. In my free time, I enjoy playing badminton, video games, and rock climbing. I am excited to continue learning and growing in my field.",
    "projects": [
      {
        "name": "Instagram Clone",
        "demoUrl":"https://instagram-clone.billylee.me",
        "codeUrl": "https://github.com/pl3lee/instagram-clone",
        "description": "I developed a fully-functional Instagram clone using a modern tech stack that includes Next.js, Express, Firebase Auth, MongoDB, Socket.io, and Node.js. The application replicates core features of Instagram such as user registration, customizable profiles, post creation, and real-time chat. I utilized MongoDB for efficient data storage and Node.js for server-side operations. The application is designed to be responsive and user-friendly, with a clean and modern interface built using Tailwind CSS.",
        "img": "https://github.com/pl3lee/instagram-clone/assets/64212628/89b94859-bb38-4298-b59a-41dc3d97771f",
        "skills": ["Next.js", "MongoDB", "Mongoose", "Socket.io", "Firebase Auth", "Express.js", "Node.js", "TypeScript", "JavaScript", "TailwindCSS"]
      },
      {
        "name": "Coding Theory Calculator",
        "demoUrl":"https://coding-theory-calculator.billylee.me",
        "codeUrl": "https://github.com/pl3lee/coding-theory-calculator",
        "description": "I developed a comprehensive Coding Theory calculator that provides solutions to a wide range of coding theory-related computational problems. The calculator is capable of performing complex operations such as decoding Hamming codes, C24 decoding, syndrome decoding, and calculating Hamming distances. The frontend of the calculator is built using the latest web technologies, including Next.js and TailwindCSS, while the backend is powered by Node.js and Express, providing a seamless and user-friendly experience.",
        "img": "https://github.com/pl3lee/coding-theory-calculator/assets/64212628/5a4d6b39-22a2-44f1-add3-99efbbaef6c4",
        "skills": ["Next.js", "Express.js", "Node.js", "TypeScript", "JavaScript", "TailwindCSS"]
      },
      {
        "name": "Recipe App",
        "demoUrl": "https://recipe.billylee.me",
        "codeUrl": "https://github.com/pl3lee/Recipe-App",
        "description": "Developed a recipe sharing web app using Next.js, Node.js, Express, and MongoDB. Implemented user authentication, authorization, and recipe saving features. Designed the UI with Material UI and managed global states with useContext. Utilized TypeScript for improved code reliability.",
        "img": "https://user-images.githubusercontent.com/64212628/229197185-f252dd1c-0c19-4f87-8398-57e4a276d6dc.png",
        "skills": ["Next.js", "MongoDB", "Mongoose", "Express.js", "Node.js", "TypeScript", "JavaScript"]
      },
      {
        "name": "Personal Website",
        "demoUrl": "portfolio.billylee.me",
        "codeUrl": "https://github.com/pl3lee/personal-website",
        "description": "Developed a personal website using Next.js and TypeScript for enhanced performance and reliability. Designed an intuitive and visually appealing user interface using TailwindCSS. Leveraged the benefits of TypeScript for improved code reliability and type safety.",
        "img": "https://user-images.githubusercontent.com/64212628/245751150-b0b83332-2e50-4a3c-b66d-5601559a1949.png",
        "skills": ["Next.js", "TypeScript", "TailwindCSS"]
      },
      {
        "name": "Biquadris",
        "demoUrl": "",
        "codeUrl": "https://github.com/pl3lee/Biquadris",
        "description": "Developed a customizable Tetris game with adjustable board dimensions and win conditions. Employed MVC and Factory Method design patterns for robust architecture and unique block configurations. Crafted an engaging GUI using the X Window System.",
        "img": "https://user-images.githubusercontent.com/64212628/162589021-6a25a89d-add8-4c51-baae-abdda55c52d8.png",
        "skills": ["C++", "Bash"]
      },
      
      {
        "name": "Bolee Products Update",
        "demoUrl": "",
        "codeUrl": "",
        "description": "A Python program that uses Selenium to automate the process of creating, updating, and deleting products from a csv file, reducing 2 months of manual labor to just 4 hours.",
        "img": "https://user-images.githubusercontent.com/64212628/245342934-61a1b61b-d14a-41a9-888d-424b58109708.png",
        "skills": ["Python", "Selenium", "Wordpresss", "JSON"]
      },
      {
        "name": "Hanabusa Properties Update",
        "demoUrl": "",
        "codeUrl": "",
        "description": "Developed a Python program that efficiently extracted residential property information and images from a Japanese real estate website using BeautifulSoup4. The program then automatically entered the data into the company’s WordPress website using Selenium, streamlining the data entry process.",
        "img": "https://user-images.githubusercontent.com/64212628/245342934-61a1b61b-d14a-41a9-888d-424b58109708.png",
        "skills": ["Python", "Selenium", "Wordpress", "BeautifulSoup"]
      },
      {
        "name": "Run Test Suite",
        "demoUrl": "",
        "codeUrl": "",
        "description": "Created a Bash script that checks if a given program matches the output of the given test suite. Part of the curriculum of the OOP course that I took at the University of Waterloo.",
        "img": "https://github-production-user-asset-6210df.s3.amazonaws.com/64212628/245342720-1d842d87-848c-48ce-9d89-3a60a410f840.jpg",
        "skills": ["Bash"]
      }
    ],
    "freelanceProjects": [
      {
        "name": "Sai Kung Sailing",
        "demoUrl":"https://sksail.com",
        "codeUrl": "",
        "description": "I designed and developed a sleek and user-friendly website for a small boat rental business using cutting-edge technologies such as Next.js and TailwindCSS. The website features a seamless booking functionality powered by Cal.com, allowing customers to easily reserve boats and plan their trips. The intuitive interface and smooth navigation provide an enjoyable user experience, while the visually appealing design effectively showcases the business’s offerings.",
        "img": "https://github.com/pl3lee/images/assets/64212628/e056f0d2-88a4-4487-8614-a977c041f5cc",
        "skills": ["Next.js", "TailwindCSS"]
      }
    ],
    "experiences": [
      {
        "position": "Lead Developer/DevOps Engineer",
        "company": "University of Waterloo",
        "location": "Waterloo, Ontario, Canada",
        "date": "Jan - May 2024",
        "url": "https://uwaterloo.ca/",
        "samePage": false,
        "description": "Developed a Next.js-based web platform for a figures of speech research group, enabling user submissions and annotations of figure instances. As a lead developer, I hosted weekly standup meetings, conducted code reviews for merge requests, and set up a documentation site with a CD pipeline to ensure proper project documentation. I also revamped the CI/CD process using GitLab pipelines, Docker, and Docker compose, automating and accelerating testing, building, and deployment phases.",
        "skills": ["NextJS", "TypeScript", "Docker", "GitLab CI/CD"]
      },
      {
        "position": "Full Stack Developer",
        "company": "University of Waterloo",
        "location": "Waterloo, Ontario, Canada",
        "date": "Sept - Dec 2023",
        "date2": "Jan - Apr 2023",
        "url": "https://uwaterloo.ca/",
        "samePage": false,
        "description": "I worked on both the frontend, using Next.js and TypeScript, and the backend, using Golang. I spearheaded the implementation of advanced features including rich text support and dynamic highlighting functionality for annotations.",
        "skills": ["NextJS", "TypeScript", "Golang", "MaterialUI", "GitLab", "Jest"]
      },
      {
        "position": "Freelance Web Developer",
        "company": "NA",
        "location": "Remote",
        "date": "Jun 2023 - Current",
        "url": "#freelance-projects",
        "samePage": true,
        "description": "As a Freelance Web Developer, I had the opportunity to work on a web development project for a client, delivering a high-quality and customized solution. The project involved designing and developing a website using Next.js and TailwindCSS to meet the specific needs of the client. I worked closely with the client to understand their requirements and implemented features such as a booking functionality and an email contact us form. The website was well-received by the client and has helped them streamline their booking process and improve communication with customers. This project allowed me to showcase my skills in web development and deliver exceptional results.",
        "skills": ["Next.js", "TailwindCSS"]
      },
      {
        "position": "Software Developer Intern",
        "company": "Hewlett Packard Enterprise",
        "location": "Hong Kong SAR, China",
        "date": "Jun - Aug 2023",
        "url": "https://www.hpe.com/us/en/home.html",
        "samePage": false,
        "description": "I was responsible for creating demo processes for various HPE GreenLake solutions, including Ezmeral, Private Cloud Enterprise, Aruba SASE, Citrix VDI, Zerto, Azure Stack, and DSCC. I designed a React.js webpage to showcase the available demos and their corresponding guides, which were created using Microsoft Word. To enhance the user experience, I recorded the demo processes using OBS Studio and automated parts of them with Python, PowerShell, and Bash scripts. I regularly worked with VMWare vSphere VMs to set up demo environments and even created a dedicated VM to host the demo website using Apache.",
        "skills": ["React.js", "Apache", "HPE GreenLake", "VMWare vSphere", "Python", "Bash", "PowerShell"]
      },
      {
        "position": "Software Developer Intern",
        "company": "Bolee Machine Tool Ltd.",
        "location": "Hong Kong SAR, China",
        "date": "Apr - Jun 2023",
        "url": "https://www.bolee.hk/",
        "samePage": false,
        "description": "Efficiently managed and maintained the company’s Wordpress website by developing a Python program that uses Selenium to automate the process of creating, updating, and deleting products from a csv file, reducing 2 months of manual labor to just 4 hours. Also Managed the company’s server system, including configuring the VPN server for remote access and upgrading the storage of the NAS server.",
        "skills": ["Python", "Selenium", "Wordpress"]
      },
      {
        "position": "Automation Developer",
        "company": "Hanabusa Japan Real Estate",
        "location": "Japan (Remote)",
        "date": "Sep - Sep 2021",
        "url": "https://hanabusa.cc/",
        "samePage": false,
        "description": "Developed a Python program that efficiently extracted residential property information and images from a Japanese real estate website using BeautifulSoup4. The program then automatically entered the data into the company’s WordPress website using Selenium, streamlining the data entry process.",
        "skills": ["Python", "Selenium", "BeautifulSoup4", "Wordpress"]
      }
    ],
    "academics": [
      {
        "name": "University of Waterloo",
        "description": "Honours Bachelor of Mathematics - Fourth Year",
        "location": "Ontario, Canada",
        "date": "Sep 2020 - Aug 2024",
        "major": "Computational Mathematics and Combinatorics & Optimization",
        "minor": "Computer Science",
        "cgpa": "88.56/100",
        "mav": "86.81/100",
        "url": "https://uwaterloo.ca/",
        "img": "https://user-images.githubusercontent.com/64212628/245346483-e3a2287d-50de-45f2-8261-058488ca99ef.png"
      }
    ]
  }